backend/app/controllers/events_options_controller.rb

  def index
    @events_options = EventsOption.all
---
SELECT "events_options".* FROM "events_options"

  def create
    @events_option = EventsOption.new(events_option_params)

    if @events_option.save
---
INSERT INTO "events_options" ("options", "eventName", "voting_event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["options", "yes or no"], ["eventName", "referendum"], ["voting_event_id", 1], ["created_at", "2023-07-29 15:08:19.744589"], ["updated_at", "2023-07-29 15:08:19.744589"]]

  def update
    if @events_option.update(events_option_params)
---
UPDATE "events_options" SET "options" = ?, "updated_at" = ? WHERE "events_options"."id" = ?  [["options", "yes , no , maybe"], ["updated_at", "2023-07-29 15:09:40.998970"], ["id", 1]]

  def destroy
    @events_option.destroy
---
DELETE FROM "events_options" WHERE "events_options"."id" = ?  [["id", 1]]

  def set_events_option
    @events_option = EventsOption.find(params[:id])
---
SELECT "events_options".* FROM "events_options" WHERE "events_options"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]