backend/app/controllers/user_votes_controller.rb

  def index
    @user_votes = UserVote.all
---
SELECT "user_votes".* FROM "user_votes"

  def create
    # puts "@current_user: #{@current_user.inspect}"
#     voting_event_id = params[:voting_event_id]
#     user_id = params[:user_id]

# # user_votes = UserVote.where(voting_event_id: voting_event_id, user_id: user_id)
#     existing_vote_event = UserVote.where(voting_event_id: voting_event_id, user_id: user_id)
#     if existing_vote_event
#       render json: {message: "You have already voted for this event"}, status: :ok
#     else
      user_vote = UserVote.new(user_vote_params)
      user_vote.user_id = user_vote_params[:user_id]
      user_vote.candidate_id = user_vote_params[:candidate_id]
      user_vote.voting_event_id= user_vote_params[:voting_event_id]

      if user_vote.save
---
INSERT INTO "user_votes" ("user_id", "voting_event_id", "candidate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["voting_event_id", 20], ["candidate_id", 30], ["created_at", "2023-08-07 00:12:09.636824"], ["updated_at", "2023-08-07 00:12:09.636824"]]

  def update
    @user_vote.user_id = @current_user.id

    if @user_vote.update(user_vote_params)
---
UPDATE "user_votes" SET "eventName" = ?, "updated_at" = ? WHERE "user_votes"."id" = ?  [["eventName", " by-elections"], ["updated_at", "2023-07-29 11:32:21.484906"], ["id", 1]]

  def destroy
    @user_vote.destroy
---
DELETE FROM "user_votes" WHERE "user_votes"."id" = ?  [["id", 1]]

  def by_event_id
    @candidates = UserVote.where(voting_event_id: params[:voting_event_id])
---
SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."voting_event_id" = ?  [["voting_event_id", 19]]

  def set_user_vote
    @user_vote = UserVote.find(params[:id])
---
SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]