backend/app/controllers/voting_events_controller.rb

SELECT "voting_events".* FROM "voting_events"
---
  def index
    @voting_events = VotingEvent.all

SELECT "voting_events".* FROM "voting_events" WHERE "voting_events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    voting_event = VotingEvent.find_by(id: params[:id])

INSERT INTO "voting_events" ("eventsName", "eventsDescription", "duration", "eventDate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    voting_event = VotingEvent.new(voting_event_params)

    if voting_event.save

UPDATE "voting_events" SET "eventsName" = ?, "eventsDescription" = ?, "updated_at" = ? WHERE "voting_events"."id" = ?  [["eventsName", "by-elections"], ["eventsDescription", "voting for president of the country and members of parliament"], ["updated_at", "2023-07-29 07:50:03.422171"], ["id", 2]]
---
  def update
    if @current_user && @voting_event.update(voting_event_params)

DELETE FROM "voting_events" WHERE "voting_events"."id" = ?  [["id", 1]]
---
  def destroy
    if @current_user && @voting_event.destroy

SELECT "voting_events".* FROM "voting_events" WHERE "voting_events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_voting_event
      @voting_event = VotingEvent.find_by(id: params[:id])